## Topic: Data Time and Time Delta in DF

### OUTCOMES

- 1. DateTime

- 2. TimeDelta

### 1. DateTime

- DataTime represent data and time values in a structured Format.

- Extracting year, month, day, hour etc.

- syntax:
    - pd.to_datetime(data,format = None)

    - data => A column, or Series of time string format(object format)

    - format => yera-month-day

In [1]:
import pandas as pd

In [7]:
# load file
df = pd.read_csv('student_completed_data.csv')

df.head(3)

,StudentID,FullName,CompletionStatus,EnrollmentDate,FinishedDate,Instructor,Location,Total Marks
0,PH0001,Alif Rahman,Completed,2024-09-01,2024-12-23,Ms. Salma,Khulna,300
1,PH0002,Fatima Akhter,Completed,2024-08-11,2024-11-07,Mr. Karim,Dhaka,271
2,PH0003,Imran Hossain,Completed,2024-05-08,2024-08-08,Ms. Salma,Dhaka,269

In [ ]:
# To check the Data type of column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   StudentID         20 non-null     object
 1   FullName          20 non-null     object
 2   CompletionStatus  20 non-null     object
 3   EnrollmentDate    20 non-null     object
 4   FinishedDate      20 non-null     object
 5   Instructor        20 non-null     object
 6   Location          20 non-null     object
 7   Total Marks       20 non-null     int64
dtypes: int64(1), object(7)
memory usage: 1.4+ KB

In [9]:
# first convert data type object format to datatime64 data format 

df['EnrollmentDate'] = pd.to_datetime(df['EnrollmentDate'])

df.head()

,StudentID,FullName,CompletionStatus,EnrollmentDate,FinishedDate,Instructor,Location,Total Marks
0,PH0001,Alif Rahman,Completed,2024-09-01,2024-12-23,Ms. Salma,Khulna,300
1,PH0002,Fatima Akhter,Completed,2024-08-11,2024-11-07,Mr. Karim,Dhaka,271
2,PH0003,Imran Hossain,Completed,2024-05-08,2024-08-08,Ms. Salma,Dhaka,269
3,PH0004,Jannatul Ferdous,Completed,2024-07-05,2024-09-23,Mr. Karim,Khulna,270
4,PH0005,Kamal Uddin,Completed,2024-02-01,2024-04-17,Mr. David,Sylhet,254

In [ ]:
df.info()

# here, EnrollmentDate data type is convert to datetime64 format

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   StudentID         20 non-null     object
 1   FullName          20 non-null     object
 2   CompletionStatus  20 non-null     object
 3   EnrollmentDate    20 non-null     datetime64[ns]
 4   FinishedDate      20 non-null     object
 5   Instructor        20 non-null     object
 6   Location          20 non-null     object
 7   Total Marks       20 non-null     int64
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 1.4+ KB

In [ ]:
# now, Extract Date Components 
# Year

df['Year'] = df['EnrollmentDate'].dt.year

df.head()

,StudentID,FullName,CompletionStatus,EnrollmentDate,FinishedDate,Instructor,Location,Total Marks,Year
0,PH0001,Alif Rahman,Completed,2024-09-01,2024-12-23,Ms. Salma,Khulna,300,2024
1,PH0002,Fatima Akhter,Completed,2024-08-11,2024-11-07,Mr. Karim,Dhaka,271,2024
2,PH0003,Imran Hossain,Completed,2024-05-08,2024-08-08,Ms. Salma,Dhaka,269,2024
3,PH0004,Jannatul Ferdous,Completed,2024-07-05,2024-09-23,Mr. Karim,Khulna,270,2024
4,PH0005,Kamal Uddin,Completed,2024-02-01,2024-04-17,Mr. David,Sylhet,254,2024

In [12]:
# Extract Date Component 
# month

df['Month'] = df['EnrollmentDate'].dt.month

df.head(3)

,StudentID,FullName,CompletionStatus,EnrollmentDate,FinishedDate,Instructor,Location,Total Marks,Year,Month
0,PH0001,Alif Rahman,Completed,2024-09-01,2024-12-23,Ms. Salma,Khulna,300,2024,9
1,PH0002,Fatima Akhter,Completed,2024-08-11,2024-11-07,Mr. Karim,Dhaka,271,2024,8
2,PH0003,Imran Hossain,Completed,2024-05-08,2024-08-08,Ms. Salma,Dhaka,269,2024,5

In [15]:
# Extract Date Component
# day

df['Day'] = df['EnrollmentDate'].dt.day

df.head(4)

,StudentID,FullName,CompletionStatus,EnrollmentDate,FinishedDate,Instructor,Location,Total Marks,Year,Month,Day
0,PH0001,Alif Rahman,Completed,2024-09-01,2024-12-23,Ms. Salma,Khulna,300,2024,9,1
1,PH0002,Fatima Akhter,Completed,2024-08-11,2024-11-07,Mr. Karim,Dhaka,271,2024,8,11
2,PH0003,Imran Hossain,Completed,2024-05-08,2024-08-08,Ms. Salma,Dhaka,269,2024,5,8
3,PH0004,Jannatul Ferdous,Completed,2024-07-05,2024-09-23,Mr. Karim,Khulna,270,2024,7,5

### TimeDelta in Pandas

- Represent the difference between two datatime values(duration or time gap)

- Syntax:
    - first convert object data type to datetime64 data type
    - pd.to_timedate(data)

    - 2nd use TimeDelta:
        - pd.to_timedelta(arg, unit = 'd')

In [ ]:
# first conver object data type to datetime64

df['FinishedDate'] = pd.to_datetime(df['FinishedDate'])

df.head()

,StudentID,FullName,CompletionStatus,EnrollmentDate,FinishedDate,Instructor,Location,Total Marks,Year,Month,Day
0,PH0001,Alif Rahman,Completed,2024-09-01,2024-12-23,Ms. Salma,Khulna,300,2024,9,1
1,PH0002,Fatima Akhter,Completed,2024-08-11,2024-11-07,Mr. Karim,Dhaka,271,2024,8,11
2,PH0003,Imran Hossain,Completed,2024-05-08,2024-08-08,Ms. Salma,Dhaka,269,2024,5,8
3,PH0004,Jannatul Ferdous,Completed,2024-07-05,2024-09-23,Mr. Karim,Khulna,270,2024,7,5
4,PH0005,Kamal Uddin,Completed,2024-02-01,2024-04-17,Mr. David,Sylhet,254,2024,2,1

In [ ]:
df['FinishedDate'].info()

# Type -> datetime64

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: FinishedDate
Non-Null Count  Dtype
--------------  -----
20 non-null     datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 292.0 bytes

In [19]:
df['Time Taken for Finish'] = df['FinishedDate'] - df['EnrollmentDate']

df.head(5)

,StudentID,FullName,CompletionStatus,EnrollmentDate,FinishedDate,Instructor,Location,Total Marks,Year,Month,Day,Time Taken for Finish
0,PH0001,Alif Rahman,Completed,2024-09-01,2024-12-23,Ms. Salma,Khulna,300,2024,9,1,113 days
1,PH0002,Fatima Akhter,Completed,2024-08-11,2024-11-07,Mr. Karim,Dhaka,271,2024,8,11,88 days
2,PH0003,Imran Hossain,Completed,2024-05-08,2024-08-08,Ms. Salma,Dhaka,269,2024,5,8,92 days
3,PH0004,Jannatul Ferdous,Completed,2024-07-05,2024-09-23,Mr. Karim,Khulna,270,2024,7,5,80 days
4,PH0005,Kamal Uddin,Completed,2024-02-01,2024-04-17,Mr. David,Sylhet,254,2024,2,1,76 days

In [ ]:
Which method moves the file pointer to a specific position?

A) close()

B) seek()

C) tell()

D) flush()